Repository: common-repository/sendpulse-web-push
Catalog: languages/sendpulse-webpush-*.po
Languages: ru_ru

source: Add the plugin to WordPress by searching and installing, uploading a zip, FTP copy, or some other way, and activate it.
ru_ru: Установите плагин из магазина Wordpress, загрузите zip архив через ручное добавление плагинов, закачайте используя FTP клиент либо установите плагин любым другим удобным для вас способом.

source: After activation complete click on Setting link under plugin name.
ru_ru: После установки и активации плагина нажмите на ссылку "Настройки" под именем плагина или используя боковое меню Wordpress: WebPush->Настройки

source: Copy code generated after site connection. Example: <code>&lt;sсript charset="UTF-8" src="//web.webpushs.com/js/push/your_generated_hash_id.js" async&gt;&lt;/&gt;</code>
ru_ru: Скопируйте код, сгенерированный после подключения сайта к Push-уведомлениям. Пример: <code>&lt;sсript charset="UTF-8" src="//web.webpushs.com/js/push/your_generated_hash_id.js" async&gt;&lt;/&gt;</code>

source: https://sendpulse.com/integrations/cms/wordpress
ru_ru: https://sendpulse.com/ru/integrations/cms/wordpress

source: https://sendpulse.com/webpush?utm_source=wordpress
ru_ru: https://sendpulse.com/ru/features/webpush?utm_source=wordpress

source: If you have an account at <a href="https://sendpulse.com/" target="blank">SendPulse</a> go to Push tab. If not register at <a href="https://sendpulse.com/register" target="blank">Sendpulse</a>.
ru_ru: Если у вас уже есть аккаунт в <a href="https://sendpulse.com/ru/" target="blank">SendPulse</a> перейдите на сайт под своим аккаунтом и выберите вкладку "Push". Если вы еще не зарегистрированы то зарегистрируйтесь <a href="https://sendpulse.com/ru/register" target="blank">https://sendpulse.com/register</a>.

source: Insert integration code
ru_ru: Вставьте код интеграции

source: Installation
ru_ru: Установка и настройка

source: Mark the checkbox if you want to pass information about your registered users to your account.
ru_ru: Установите чекбокс, если хотите передавать информацию о зарегистрированных пользователях в свой аккаунт.

source: Note: this event is triggered only when a new user signs up
ru_ru: Обратите внимение: данные отправляются при регистрации пользователя.

source: Pass emails and usernames of Wordpress users for personalization.
ru_ru: Передавать email адреса и имена зарегистрированных пользователей для персонализации.

source: Past generated code on Settings page
ru_ru: Добавьте сгенерированный код на страницу "Настройки"

source: Register on Sendpulse
ru_ru: Зарегистрироваться в Sendpulse

source: SendPulse Free Web Push
ru_ru: Push-уведомления от SendPulse

source: SendPulse Free Web Push plugin adds your web push integration code into the &lt;head&gt; section of your website. The plugin will enable web push subscription requests to your website visitors and optionally pass emails and names of logged in users for segmentation and personalization. To get started: 1)Click the "Activate" link to the left of this description, 2) Sign up for a free <a href="https://sendpulse.com/webpush/register?utm_source=wordpress&utm_medium=referral&utm_campaign=wordpresspush">Sendpulse account</a>, and 3) Add your website to SendPulse, copy and paste the integation code into the plugin settings section
ru_ru: Плагин Push-уведомлений от SendPulse вставляет код интеграции в блок "head" вашего сайта. Плагин предлагает подписаться посетителям вашего сайта, а также передает email адреса и логин пользователей для сегментации и персонализации. Чтобы начать: 1) Нажмите на кнопку «Активировать» слева от данного описания 2) Зарегистрируйтесь бесплатно <a href="https://sendpulse.com/ru/webpush/register?utm_source=wordpress&utm_medium=referral&utm_campaign=wordpresspush"> в сервисе SendPulse </a>. 3) Добавьте свой сайт в личном кабинете сервиса, скопируйте и вставьте код интеграции в настройки плагина.

source: Settings
ru_ru: Настройки

source: Succesfully edited %s!
ru_ru: Успешно отредактировано %s!

source: That's all. You connected Push Messages to your site.
ru_ru: Это все. Вы подключили Push-уведомления к своему сайту

source: The code is not updated
ru_ru: Код не обновлен

source: The code you put in here will be inserted into the &lt;head&gt; tag on every page.
ru_ru: Код, который вы вставите сюда, будет добавлен в блок "head" на каждой странице

source: You need to <a target="_blank" href="https://sendpulse.com/webpush?utm_source=wordpress">create a free account</a> to get the web push integration code and send web push notifications.
ru_ru: <a target="_blank" href="https://sendpulse.com/webpush?utm_source=wordpress">Создайте бесплатный аккаунт</a>, чтобы получить код интеграции и отправлять push уведомления.
